Repository: tabtin-ai/TabTin
Catalog: apps/tabtin-ios/Tabtin/Resources/Localizations/Agent.xcstrings
Source language: zh_hans
Languages: en

# agent.runtime.thinking.detailHint
source: 轻点查看完整思考过程
en: Double tap to view the full thought process

# agent.runtime.mediaImage.generating
source: 正在生成图片
en: Generating image

# agent.runtime.mediaImage.failed
source: 生成失败
en: Generation failed

# agent.runtime.mediaImage.viewDetails
source: 查看详情
en: View details

# agent.runtime.mediaImage.hideDetails
source: 收起详情
en: Hide details

# agent.runtime.compaction.inProgress
source: 正在压缩上下文...
en: Compacting context...

# agent.runtime.compaction.checkpoint
source: 上下文已压缩到此，后续对话将使用摘要继续
en: Context was compacted here. Future turns will continue from the summary.

# agent.runtime.tool.executeCommand
source: 执行命令
en: Run command

# agent.runtime.tool.readFile
source: 读取文件
en: Read file

# agent.runtime.tool.writeFile
source: 写入文件
en: Write file

# agent.runtime.tool.editFile
source: 编辑文件
en: Edit file

# agent.runtime.tool.deleteFile
source: 删除文件
en: Delete file

# agent.runtime.tool.query
source: 查询
en: Query

# agent.runtime.tool.webSearch
source: 网络搜索
en: Web search

# agent.runtime.tool.fetchWeb
source: 抓取网页
en: Fetch page

# agent.runtime.tool.codeSearch
source: 代码搜索
en: Code search

# agent.runtime.tool.gitStatus
source: 查看 Git 状态
en: Git status

# agent.runtime.tool.gitDiff
source: 查看 Git 差异
en: Git diff

# agent.runtime.tool.updateTodo
source: 更新清单
en: Update todo

# agent.runtime.tool.dispatchTask
source: 派发子任务
en: Delegate task

# agent.runtime.tool.askUser
source: 询问用户
en: Ask user

# agent.runtime.tool.writeMemory
source: 写入记忆
en: Write memory

# agent.runtime.tool.deleteMemory
source: 删除记忆
en: Delete memory

# agent.runtime.tool.showWidget
source: 展示组件
en: Show widget

# agent.runtime.tool.presentResult
source: 呈现结果
en: Present result

# agent.runtime.tool.generic
source: 工具调用
en: Tool call

# agent.runtime.tool.deviceInfo
source: 读取设备信息
en: Device info

# agent.runtime.tool.batteryInfo
source: 读取电池信息
en: Battery info

# agent.runtime.tool.networkInfo
source: 读取网络信息
en: Network info

# agent.runtime.tool.readContacts
source: 读取联系人
en: Read contacts

# agent.runtime.tool.readSms
source: 读取短信
en: Read SMS

# agent.runtime.tool.sendSms
source: 发送短信
en: Send SMS

# agent.runtime.tool.readCallLog
source: 读取通话记录
en: Read call log

# agent.runtime.tool.makeCall
source: 拨打电话
en: Place call

# agent.runtime.tool.readCalendar
source: 读取日历
en: Read calendar

# agent.runtime.tool.readNotifications
source: 读取通知
en: Read notifications

# agent.runtime.tool.listApps
source: 读取应用列表
en: List apps

# agent.runtime.tool.readMedia
source: 读取媒体
en: Read media

# agent.runtime.tool.getLocation
source: 读取位置
en: Get location

# agent.runtime.tool.screenCapture
source: 截取屏幕
en: Capture screen

# agent.runtime.tool.screenSnapshot
source: 读取屏幕
en: Read screen

# agent.runtime.tool.screenUiTree
source: 读取界面结构
en: Read UI tree

# agent.runtime.tool.screenTap
source: 点击屏幕
en: Tap screen

# agent.runtime.tool.screenSwipe
source: 滑动屏幕
en: Swipe screen

# agent.runtime.tool.screenLongPress
source: 长按屏幕
en: Long press

# agent.runtime.tool.findElement
source: 查找界面元素
en: Find element

# agent.runtime.tool.typeText
source: 输入文本
en: Type text

# agent.runtime.tool.typeSecret
source: 输入敏感文本
en: Type secret

# agent.runtime.tool.keyEvent
source: 发送按键
en: Send key

# agent.runtime.tool.waitIdle
source: 等待界面
en: Wait for UI

# agent.runtime.tool.openApp
source: 打开应用
en: Open app

# agent.runtime.tool.stopApp
source: 停止应用
en: Stop app

# agent.runtime.tool.systemSetting
source: 系统设置
en: System settings

# agent.runtime.tool.stealthMode
source: 隐身模式
en: Stealth mode

# agent.runtime.tool.launchIntent
source: 打开链接
en: Open link

# agent.runtime.tool.saveToDevice
source: 保存到设备
en: Save to device

# agent.runtime.tool.automationStatus
source: 读取自动化状态
en: Automation status

# agent.runtime.tool.findContent
source: 查找内容
en: Find content

# agent.runtime.tool.removeContent
source: 移除内容
en: Remove content

# agent.runtime.tool.restoreContent
source: 恢复内容
en: Restore content

# agent.runtime.tool.createContent
source: 创建内容
en: Create content

# agent.runtime.tool.updateContent
source: 更新内容
en: Update content

# agent.runtime.tool.publishContent
source: 发布内容
en: Publish content

# agent.runtime.tool.handleDoc
source: 处理文档
en: Handle document

# agent.runtime.tool.handleMemo
source: 处理笔记
en: Handle note

# agent.runtime.tool.handleSite
source: 处理站点
en: Handle site

# agent.runtime.tool.handleTable
source: 处理表格
en: Handle table

# agent.runtime.tool.drawer.input
source: 输入
en: Input

# agent.runtime.tool.drawer.result
source: 结果
en: Result

# agent.runtime.tool.drawer.error
source: 错误
en: Error

# agent.runtime.tool.drawer.viewRaw
source: 查看原始数据
en: View raw data

# agent.runtime.tool.drawer.running
source: 执行中…
en: Running…

# agent.runtime.tool.key.file
source: 文件
en: File

# agent.runtime.tool.key.command
source: 命令
en: Command

# agent.runtime.tool.key.query
source: 查询
en: Query

# agent.runtime.tool.key.url
source: 网址
en: URL

# agent.thinking.off
source: 关闭
en: Off

# agent.thinking.low
source: 低
en: Low

# agent.thinking.medium
source: 中
en: Medium

# agent.thinking.high
source: 高
en: High

# agent.settings.trash
source: 回收站
en: Trash

# agent.skills.configure
source: 配置
en: Configure

# agent.skills.incompatible
source: 不兼容
en: Incompatible

# agent.skills.apiKeyHint
source: 此 Skill 需要 %@ 才能正常工作
en: This skill requires %@ to function properly

# agent.skills.dependencies
source: 依赖
en: Dependencies

# agent.skills.requiredBins
source: 必需工具
en: Required Tools

# agent.skills.envVars
source: 环境变量
en: Environment Variables

# agent.skills.installGuide
source: 安装说明
en: Installation

# agent.skills.installDesktopHint
source: 安装命令需在桌面端执行
en: Installation commands must be run on the desktop app

# agent.skills.source
source: 来源
en: Source

# agent.skills.sourceType
source: 类型
en: Type

# agent.skills.homepage
source: 主页
en: Homepage

# agent.skills.configTitle
source: Skill 配置
en: Skill Configuration

# agent.skills.readiness.ready
source: 就绪
en: Ready

# agent.skills.readiness.needsConfig
source: 需配置
en: Needs Config

# agent.skills.readiness.needsInstall
source: 需安装
en: Needs Install

# agent.skills.readiness.incompatible
source: 不兼容
en: Incompatible

# agent.skills.source.marketplace
source: 市场
en: Marketplace

# agent.skills.source.managed
source: 已安装
en: Managed

# agent.skills.source.local
source: 本地
en: Local

# agent.skills.source.system
source: 系统
en: System

# agent.skills.source.builtin
source: 内置
en: Built-in

# agent.searchPlaceholder
source: 搜索 Agent
en: Search Agents

# agent.notFound
source: Agent 不存在
en: Agent not found

# agent.unnamedSession
source: 未命名会话
en: Untitled Conversation

# agent.noConversationsHint.named
source: 与 %@ 开始第一段对话。
en: Start the first conversation with %@.

# agent.sessionPendingPill
source: 待处理
en: Pending

# agent.outgoingAwaitingDevice
source: 消息已送达，等待执行设备
en: Message delivered, waiting for an execution device

# agent.capsule.hitl.approve
source: 同意
en: Allow

# agent.capsule.hitl.deny
source: 拒绝
en: Deny

# agent.capsule.hitl.viewDetails
source: 查看详情
en: View details

# agent.capsule.hitl.answerInConversation
source: 去对话回答
en: Answer in conversation

# agent.capsule.hitl.approvalKind
source: 需要放行
en: Approval needed

# agent.capsule.hitl.choiceKind
source: 在问你
en: Question

# agent.capsule.hitl.waitingOwnerApproval
source: 正在等待执行负责人处理这项请求。
en: Waiting for the execution owner to handle this request.

# agent.capsule.hitl.waitingOwnerAnswer
source: 正在等待执行负责人回答这个问题。
en: Waiting for the execution owner to answer this question.

# agent.capsule.hitl.choiceFallback
source: Agent 需要你选择一个答案。
en: The Agent needs you to choose an answer.

# agent.capsule.hitl.submitting
source: 提交中…
en: Submitting…

# agent.capsule.hitl.errorRetryHint
source: 提交失败，再选一次即可重试。
en: Submission failed. Choose again to retry.

# agent.capsule.hitl.approvalHint
source: 就地处理，不离开当前工作。
en: Handle it here without leaving your work.

# agent.capsule.hitl.choiceHint
source: 快捷选择直接回答，复杂回答进入对话。
en: Quick choices reply here; complex answers open the conversation.

# agent.capsule.hitl.approvalBatch.count
source: Agent 有 %d 个操作等待你确认。
en: The Agent has %d actions waiting for your approval.

# agent.capsule.hitl.approvalToolRequest.named
source: Agent 请求执行“%@”。
en: The Agent requests permission to %@.

# spaceList.formalAgents
source: 正式 Agent
en: Formal Agents
